# Pandas
## Phase : 1
### Primary data structure : 
1. Series : 1D data , one dimensional homogenious array . It is size immutable
2. DataFrame : 2D Data , can have n no of hetrogenious array . It is size mutable

In [1]:
import pandas as pd

* Pandas are used to do data manipulation , and data analysis
* Handles millions of rows efficeintly
* Easy to use .
* works with libraries like matplotlib , skykit etc .
### Real Life examples :
1. Analysing the time series data like stock prices to identify market trends .
2. Traking inventory and finding the most sold products in the store .
* The basic intension should be to do data manipulation and then data analysis .

In [2]:
 # read data form csv file into a dataframe
df=pd.read_csv("machine.csv",encoding="latin1")
print(df)

    Series_reference   Period  Data_value  Suppressed STATUS   UNITS  \
0        BDCQ.SEA1AA  2011.06       80078         NaN      F  Number
1        BDCQ.SEA1AA  2011.09       78324         NaN      F  Number
2        BDCQ.SEA1AA  2011.12       85850         NaN      F  Number
3        BDCQ.SEA1AA  2012.03       90743         NaN      F  Number
4        BDCQ.SEA1AA  2012.06       81780         NaN      F  Number
..               ...      ...         ...         ...    ...     ...
602      BDCQ.SEA1DS  2016.12       16245         NaN      R  Number
603      BDCQ.SEA1DS  2017.03       17207         NaN      R  Number
604      BDCQ.SEA1DS  2017.06       17243         NaN      R  Number
605      BDCQ.SEA1DS  2017.09       17678         NaN      R  Number
606      BDCQ.SEA1DS  2017.12       18145         NaN      R  Number

     Magnitude                         Subject  \
0            0  Business Data Collection - BDC
1            0  Business Data Collection - BDC
2            0  Business Data Collection - BDC
3            0  Business Data Collection - BDC
4            0  Business Data Collection - BDC
..         ...                             ...
602          0  Business Data Collection - BDC
603          0  Business Data Collection - BDC
604          0  Business Data Collection - BDC
605          0  Business Data Collection - BDC
606          0  Business Data Collection - BDC

                               Group Series_title_1  \
0    Industry by employment variable    Filled jobs
1    Industry by employment variable    Filled jobs
2    Industry by employment variable    Filled jobs
3    Industry by employment variable    Filled jobs
4    Industry by employment variable    Filled jobs
..                               ...            ...
602  Industry by employment variable    Filled jobs
603  Industry by employment variable    Filled jobs
604  Industry by employment variable    Filled jobs
605  Industry by employment variable    Filled jobs
606  Industry by employment variable    Filled jobs

                                 Series_title_2       Series_title_3  \
0             Agriculture, Forestry and Fishing               Actual
1             Agriculture, Forestry and Fishing               Actual
2             Agriculture, Forestry and Fishing               Actual
3             Agriculture, Forestry and Fishing               Actual
4             Agriculture, Forestry and Fishing               Actual
..                                          ...                  ...
602  Electricity, Gas, Water and Waste Services  Seasonally adjusted
603  Electricity, Gas, Water and Waste Services  Seasonally adjusted
604  Electricity, Gas, Water and Waste Services  Seasonally adjusted
605  Electricity, Gas, Water and Waste Services  Seasonally adjusted
606  Electricity, Gas, Water and Waste Services  Seasonally adjusted

     Series_title_4  Series_title_5
0               NaN             NaN
1               NaN             NaN
2               NaN             NaN
3               NaN             NaN
4               NaN             NaN
..              ...             ...
602             NaN             NaN
603             NaN             NaN
604             NaN             NaN
605             NaN             NaN
606             NaN             NaN

[607 rows x 14 columns]

In [3]:
import pandas as pd
# ceratign a dataframe and svaing it to a file 
data={
    "Name":['ram','sham','ghansham'],
    "Age":[10,20,30],
    "City":["Nagpur","mumbai","Rohtak"]

}

df=pd.DataFrame(data)
print(df)
df.to_csv("output.csv",index="False")
df.to_excel("output1.xlsx",index="True")
df.to_json("Output2.json",index="True")

       Name  Age    City
0       ram   10  Nagpur
1      sham   20  mumbai
2  ghansham   30  Rohtak

1. understand the data set
2. identify the problems
3. plan next steps

> the way to read some rows , it can be done by head() and tail() method 
* head(n) will give first n rows of the data  , fi n is not given then it will return the first 5 rows of the data frame
* tail(n)  will return the last rows of the data frame , if n is not given then it will return the last 5 rows of the data frame

In [4]:
df=pd.read_csv("machine.csv")
print("Display first 10 rows :",df.head(10))
print("displeay last 10 rows :",df.tail(10))

Display first 10 rows :   Series_reference   Period  Data_value  Suppressed STATUS   UNITS  Magnitude  \
0      BDCQ.SEA1AA  2011.06       80078         NaN      F  Number          0
1      BDCQ.SEA1AA  2011.09       78324         NaN      F  Number          0
2      BDCQ.SEA1AA  2011.12       85850         NaN      F  Number          0
3      BDCQ.SEA1AA  2012.03       90743         NaN      F  Number          0
4      BDCQ.SEA1AA  2012.06       81780         NaN      F  Number          0
5      BDCQ.SEA1AA  2012.09       79261         NaN      F  Number          0
6      BDCQ.SEA1AA  2012.12       87793         NaN      F  Number          0
7      BDCQ.SEA1AA  2013.03       91571         NaN      F  Number          0
8      BDCQ.SEA1AA  2013.06       81687         NaN      F  Number          0
9      BDCQ.SEA1AA  2013.09       81471         NaN      F  Number          0

                          Subject                            Group  \
0  Business Data Collection - BDC  Industry by employment variable
1  Business Data Collection - BDC  Industry by employment variable
2  Business Data Collection - BDC  Industry by employment variable
3  Business Data Collection - BDC  Industry by employment variable
4  Business Data Collection - BDC  Industry by employment variable
5  Business Data Collection - BDC  Industry by employment variable
6  Business Data Collection - BDC  Industry by employment variable
7  Business Data Collection - BDC  Industry by employment variable
8  Business Data Collection - BDC  Industry by employment variable
9  Business Data Collection - BDC  Industry by employment variable

  Series_title_1                     Series_title_2 Series_title_3  \
0    Filled jobs  Agriculture, Forestry and Fishing         Actual
1    Filled jobs  Agriculture, Forestry and Fishing         Actual
2    Filled jobs  Agriculture, Forestry and Fishing         Actual
3    Filled jobs  Agriculture, Forestry and Fishing         Actual
4    Filled jobs  Agriculture, Forestry and Fishing         Actual
5    Filled jobs  Agriculture, Forestry and Fishing         Actual
6    Filled jobs  Agriculture, Forestry and Fishing         Actual
7    Filled jobs  Agriculture, Forestry and Fishing         Actual
8    Filled jobs  Agriculture, Forestry and Fishing         Actual
9    Filled jobs  Agriculture, Forestry and Fishing         Actual

   Series_title_4  Series_title_5
0             NaN             NaN
1             NaN             NaN
2             NaN             NaN
3             NaN             NaN
4             NaN             NaN
5             NaN             NaN
6             NaN             NaN
7             NaN             NaN
8             NaN             NaN
9             NaN             NaN
displeay last 10 rows :     Series_reference   Period  Data_value  Suppressed STATUS   UNITS  \
597      BDCQ.SEA1DS  2015.09       15962         NaN      R  Number
598      BDCQ.SEA1DS  2015.12       16143         NaN      R  Number
599      BDCQ.SEA1DS  2016.03       16372         NaN      R  Number
600      BDCQ.SEA1DS  2016.06       16416         NaN      R  Number
601      BDCQ.SEA1DS  2016.09       16533         NaN      R  Number
602      BDCQ.SEA1DS  2016.12       16245         NaN      R  Number
603      BDCQ.SEA1DS  2017.03       17207         NaN      R  Number
604      BDCQ.SEA1DS  2017.06       17243         NaN      R  Number
605      BDCQ.SEA1DS  2017.09       17678         NaN      R  Number
606      BDCQ.SEA1DS  2017.12       18145         NaN      R  Number

     Magnitude                         Subject  \
597          0  Business Data Collection - BDC
598          0  Business Data Collection - BDC
599          0  Business Data Collection - BDC
600          0  Business Data Collection - BDC
601          0  Business Data Collection - BDC
602          0  Business Data Collection - BDC
603          0  Business Data Collection - BDC
604          0  Business Data Collection - BDC
605          0  Business Data Collection - BDC
606          0  Business Data Collection - BDC

                               Group Series_title_1  \
597  Industry by employment variable    Filled jobs
598  Industry by employment variable    Filled jobs
599  Industry by employment variable    Filled jobs
600  Industry by employment variable    Filled jobs
601  Industry by employment variable    Filled jobs
602  Industry by employment variable    Filled jobs
603  Industry by employment variable    Filled jobs
604  Industry by employment variable    Filled jobs
605  Industry by employment variable    Filled jobs
606  Industry by employment variable    Filled jobs

                                 Series_title_2       Series_title_3  \
597  Electricity, Gas, Water and Waste Services  Seasonally adjusted
598  Electricity, Gas, Water and Waste Services  Seasonally adjusted
599  Electricity, Gas, Water and Waste Services  Seasonally adjusted
600  Electricity, Gas, Water and Waste Services  Seasonally adjusted
601  Electricity, Gas, Water and Waste Services  Seasonally adjusted
602  Electricity, Gas, Water and Waste Services  Seasonally adjusted
603  Electricity, Gas, Water and Waste Services  Seasonally adjusted
604  Electricity, Gas, Water and Waste Services  Seasonally adjusted
605  Electricity, Gas, Water and Waste Services  Seasonally adjusted
606  Electricity, Gas, Water and Waste Services  Seasonally adjusted

     Series_title_4  Series_title_5
597             NaN             NaN
598             NaN             NaN
599             NaN             NaN
600             NaN             NaN
601             NaN             NaN
602             NaN             NaN
603             NaN             NaN
604             NaN             NaN
605             NaN             NaN
606             NaN             NaN

### info() :
This will will provide us the :
1. no of rows and no of columns
2. column name
3. data type : int64,float64,object
4. non null counts
5. memory usage of the data frame

In [5]:
df=pd.read_csv("machine.csv",encoding="latin1")
print("Displaying  the info of the dataframe : ",df.info())
df.to_excel("output1.xlsx")#also saved the machine.csv data to the excel file

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  607 non-null    object
 1   Period            607 non-null    float64
 2   Data_value        607 non-null    int64
 3   Suppressed        0 non-null      float64
 4   STATUS            607 non-null    object
 5   UNITS             607 non-null    object
 6   Magnitude         607 non-null    int64
 7   Subject           607 non-null    object
 8   Group             607 non-null    object
 9   Series_title_1    607 non-null    object
 10  Series_title_2    607 non-null    object
 11  Series_title_3    607 non-null    object
 12  Series_title_4    0 non-null      float64
 13  Series_title_5    0 non-null      float64
dtypes: float64(4), int64(2), object(8)
memory usage: 66.5+ KB
Displaying  the info of the dataframe :  None

In [6]:
data={
    "Names":["Ram","sham","ghansham","simran","Aditi","Raj","Simran"],
    "Age":[28,94,48,56,34,54,76],
    "Salary":[50000,30000,60000,70000,110000,660000,90000],
    "Performance":[85,90,78,92,88,95,89]
}
df=pd.DataFrame(data)
print("The data is :")
print(df)
print("Describe the data : ")
print(df.describe())

The data is :
      Names  Age  Salary  Performance
0       Ram   28   50000           85
1      sham   94   30000           90
2  ghansham   48   60000           78
3    simran   56   70000           92
4     Aditi   34  110000           88
5       Raj   54  660000           95
6    Simran   76   90000           89
Describe the data :
             Age         Salary  Performance
count   7.000000       7.000000     7.000000
mean   55.714286  152857.142857    88.142857
std    23.019660  225145.455629     5.459810
min    28.000000   30000.000000    78.000000
25%    41.000000   55000.000000    86.500000
50%    54.000000   70000.000000    89.000000
75%    66.000000  100000.000000    91.000000
max    94.000000  660000.000000    95.000000

Before manipulating or analysing any dataset , we must know these two things :
1. how many rows and columns are there 
2. what are the names of the columns

In [7]:
print("The shape of the dataset is :",df.shape)
print("The name of the columns : ",df.columns)

The shape of the dataset is : (7, 4)
The name of the columns :  Index(['Names', 'Age', 'Salary', 'Performance'], dtype='object')

### data manipulation :
1. select specific column
2. filter rows
3. combine multiple conditions
firts way to filter the column , as we can get any column by just name 
col=df["column name"]
for get a specific row
row=df[df["Salary"]>50000]

#combine multiple condition
row=df[(df["column"]>value)& df["column2]>value]

In [8]:
row=df[df["Salary"]>80000]
print(row)
# selecting single column
column=df["Names"]
print(column)
#selceiting multiple column
subset=df[["Names","Age"]]
print(subset)
#slecting multiple rows
rows=df[(df["Salary"]>8000)&(df["Age"]<50)]
print(rows)

    Names  Age  Salary  Performance
4   Aditi   34  110000           88
5     Raj   54  660000           95
6  Simran   76   90000           89
0         Ram
1        sham
2    ghansham
3      simran
4       Aditi
5         Raj
6      Simran
Name: Names, dtype: object
      Names  Age
0       Ram   28
1      sham   94
2  ghansham   48
3    simran   56
4     Aditi   34
5       Raj   54
6    Simran   76
      Names  Age  Salary  Performance
0       Ram   28   50000           85
2  ghansham   48   60000           78
4     Aditi   34  110000           88

In [23]:
data={
    "Names":["Ram",None,"ghansham","simran","Aditi","Raj","Simran"],
    "Age":[28,20,48,56,34,54,76],
    "Salary":[50000,900000,60000,70000,110000,660000,90000],
    "Performance":[85,None,78,92,88,95,89]
}

df=pd.DataFrame(data)

df["Performance"]=df["Performance"].interpolate(method="linear")
print(df)
print(df.isnull())
df.loc[1,"Names"]="Yuvraj"
print(df)
df.index=["a","b","c","d","e","f","g"]
print(df)
df.loc["a","Names"]="Yuvraj"
print(df)

      Names  Age  Salary  Performance
0       Ram   28   50000         85.0
1      None   20  900000         81.5
2  ghansham   48   60000         78.0
3    simran   56   70000         92.0
4     Aditi   34  110000         88.0
5       Raj   54  660000         95.0
6    Simran   76   90000         89.0
   Names    Age  Salary  Performance
0  False  False   False        False
1   True  False   False        False
2  False  False   False        False
3  False  False   False        False
4  False  False   False        False
5  False  False   False        False
6  False  False   False        False
      Names  Age  Salary  Performance
0       Ram   28   50000         85.0
1    Yuvraj   20  900000         81.5
2  ghansham   48   60000         78.0
3    simran   56   70000         92.0
4     Aditi   34  110000         88.0
5       Raj   54  660000         95.0
6    Simran   76   90000         89.0
      Names  Age  Salary  Performance
a       Ram   28   50000         85.0
b    Yuvraj   20  900000         81.5
c  ghansham   48   60000         78.0
d    simran   56   70000         92.0
e     Aditi   34  110000         88.0
f       Raj   54  660000         95.0
g    Simran   76   90000         89.0
      Names  Age  Salary  Performance
a    Yuvraj   28   50000         85.0
b    Yuvraj   20  900000         81.5
c  ghansham   48   60000         78.0
d    simran   56   70000         92.0
e     Aditi   34  110000         88.0
f       Raj   54  660000         95.0
g    Simran   76   90000         89.0

In [40]:
df2=df[(df["Age"]>30 )| (df["Performance"]<85)]
print(df2)
print("Hat bsdk ")
df2=df[(df["Age"]>30 ) & (df["Performance"]<85)]
print(df2)

df2=df[df["Names"]!="Yuvraj" ]
print(df2)

      Names  Age  Salary  Performance
b    Yuvraj   20  900000         81.5
c  ghansham   48   60000         78.0
d    simran   56   70000         92.0
e     Aditi   34  110000         88.0
f       Raj   54  660000         95.0
g    Simran   76   90000         89.0
Hat bsdk
      Names  Age  Salary  Performance
c  ghansham   48   60000         78.0
      Names  Age  Salary  Performance
c  ghansham   48   60000         78.0
d    simran   56   70000         92.0
e     Aditi   34  110000         88.0
f       Raj   54  660000         95.0
g    Simran   76   90000         89.0